<!DOCTYPE html>
<html lang="fr-FR">

<head>
    <meta charset="UTF-8" />
    <meta name="robots" content="noindex" />
    <meta name="viewport" content="width=device-width, initial-scale=1.0" />
    <title>Présentation - Python</title>
    <link rel="icon" type="image/x-icon" href="static/favicon.ico" />
    <link rel="stylesheet" href="static/stylesheets/style.css" />
    <script type="text/javascript" src="static/js/toggleLightMode.js"></script>
</head>

<body>
    <header>
        <img class="displayed" src="images/python.svg" alt="" />
        <nav>
            <ul class="menuBar">
                <li>
                    <a href="/programPython">Présentation et explication d’un court programme</a>
                </li>
                <li>
                    <a href="https://www.python.org/" target="_blank" rel="noopener">Lien vers le site officiel Python
                        !</a>
                </li>
                <li>
                    <a href="/bonus">Bonus</a>
                </li>
                <li>
                    <button onclick="toggleLightMode()">&#x263E;</button>
                </li>
            </ul>
        </nav>
    </header><br />
    <article>
        <img src="images/Guido_van_Rossum.jpg" />
        <p>
            Python est un langage de programmation interpr&eacute;t&eacute;, de haut niveau et polyvalent.
            Cr&eacute;&eacute;e par
            <a href="https://fr.wikipedia.org/wiki/Guido_van_Rossum">Guido van Rossum</a>
            et publi&eacute;e pour la premi&egrave;re fois en 1991, la philosophie de conception de Python met l'accent
            sur la lisibilit&eacute; du code avec son utilisation notable d'espaces blancs importants. Ses constructions
            de langage et son approche orient&eacute;e objet visent &agrave; aider les programmeurs &agrave;
            &eacute;crire un code clair et logique pour des projets &agrave; petite et grande &eacute;chelle.
        </p><br />
        <p>
            Python est un langage de programmation libre (open source) d&rsquo;utilisation g&eacute;n&eacute;rale et
            multiplateforme. Il fonctionne sous un grand nombre de plateformes incluant
            <a href="https://fr.wikipedia.org/wiki/Linux">Linux</a>
            ,
            <a href="https://fr.wikipedia.org/wiki/Microsoft_Windows">Windows</a>
            ,
            <a href="https://fr.wikipedia.org/wiki/MacOS">Mac OS X, OS/2</a>
            ainsi que les nombreuses variantes d&eacute;riv&eacute;es d'
            <a href="https://fr.wikipedia.org/wiki/Unix">Unix</a>.
        </p><br />
        <p>Il est parfois consid&eacute;r&eacute; comme un langage r&eacute;serv&eacute; au script, &agrave; tort, car
            il offre un grand confort dans le d&eacute;veloppement d&rsquo;applications de divers types.</p><br />
        <p>Sa syntaxe est concise et &eacute;pur&eacute;e et permet ainsi un gain de temps pour l'&eacute;criture du
            code. Python offre une multitude de modules en standard qui apportent des fonctionnalit&eacute;s allant du
            syst&egrave;me &agrave; la gestion du courrier &eacute;lectronique, et proposent des implantations robustes
            de diverses structures de donn&eacute;es.</p><br />
        <p>
            Python allie ainsi les avantages des langages interpr&eacute;t&eacute;s tels que le
            <a href="https://fr.wikipedia.org/wiki/Bourne-Again_shell">Bash</a>
            et gr&acirc;ce &agrave; ses nombreuses fonctionnalit&eacute;s des langages compil&eacute;s tels que
            <a href="https://fr.wikipedia.org/wiki/Java_(langage)">Java</a>
            et
            <a href="https://fr.wikipedia.org/wiki/C_(langage)">C</a>.
        </p><br />
        <p>
            La machine virtuelle Python permet d'ex&eacute;cuter le code directement sans le compiler. Il est possible
            d&rsquo;utiliser Python de deux mani&egrave;res diff&eacute;rentes&nbsp;: soit en &eacute;crivant du code
            source dans des fichiers dont l'extension sera
            <span>&nbsp;</span>
            <i>.py</i>
            , soit en tapant ce code directement dans l'interpr&eacute;teur.
        </p><br />
        <span id="source">
            [
            <a href="https://fr.wikiversity.org/wiki/Python/Pr%C3%A9sentation_de_la_le%C3%A7on" target="_blank"
                rel="noopener">SOURCE</a>
            ]
        </span>
    </article>
</body>

</html>
